
#Область ОбработчикиСобытийФормы 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Параметры.Свойство("НастройкаТеста") Или Не ЗначениеЗаполнено(Параметры.НастройкаТеста) Тогда
		ОбщегоНазначения.СообщитьПользователю("Не переданы параметры в форму!",,,,Отказ);
	Иначе
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры);                                                          
		ТекстЗапроса = НастройкаТестовСервер.СформироватьТекстЗапроса(НастройкаТеста,НомерСессии,НомерСобытия,Режим);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы 

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицы 

#КонецОбласти

#Область ОбработчикиКомандФормы 

&НаКлиенте
Процедура Копировать(Команда)
	
	НастройкаТестовКлиент.СкопироватьВБуферТекстЗапроса(ТекстЗапроса);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

#КонецОбласти
