#Область ПрограммныйИнтерфейс

// Возвращает пустую структуру с параметрами строки ТЧ ЭтапыОбработкиДанных
Функция ПараметрыЗаписиЭтапа(ЭтапОбработки = Неопределено) Экспорт 

	Результат =  Новый Структура("ЭтапОбработки,", ЭтапОбработки);
	Результат.Вставить("Завершен", Ложь);
	Результат.Вставить("ТекущаяДатаСобытия", '00010101');
	Результат.Вставить("ТекущееID", 0);

	Возврат Результат;
	
КонецФункции

// Возвращает ссылку на событие в OpenSearch
Функция СсылкаНаСобытиеВOpensearch(НомерСобытия, НастройкаТеста) Экспорт

	ДанныеСобытия = НастройкаТестовВызовСервера.ДанныеСобытияДляСсылкиOpensearch(НомерСобытия, НастройкаТеста);
	
	ДатаС = ДанныеСобытия.ДатаСобытия - 60;
	ДатаПо = ДанныеСобытия.ДатаСобытия + 60;
	
	ДатаССтрокой = Формат(ДатаС, "ДФ=гггг-ММ-ддTЧЧ:мм:сс.000");
	ДатаПоСтрокой = Формат(ДатаПо, "ДФ=гггг-ММ-ддTЧЧ:мм:сс.999");

	Шаблон = "%1/app/discover#/?_g=(filters:!(),refreshInterval:(pause:!t,value:0),time:(from:'%2Z',to:'%3Z'))&_a=(columns:!(CompoundContext),filters:!(('$state':(store:appState),meta:(alias:!n,disabled:!f,index:'%4',key:event,negate:!f,params:(query:DBMSSQL),type:phrase),query:(match_phrase:(event:DBMSSQL))),('$state':(store:appState),meta:(alias:!n,disabled:!f,index:'%4',key:pprocessName,negate:!f,params:(query:%5),type:phrase),query:(match_phrase:(pprocessName:%5))),('$state':(store:appState),meta:(alias:!n,disabled:!f,index:'%4',key:dbpid,negate:!f,params:(query:'%6'),type:phrase),query:(match_phrase:(dbpid:'%6')))),index:'%4',interval:auto,query:(language:kuery,query:''),sort:!())";
	
	Ссылка = СтрШаблон(Шаблон, ДанныеСобытия.СсылкаOpenSearch, ДатаССтрокой, ДатаПоСтрокой, ДанныеСобытия.ИдентификаторПатернаOpenSearch, ДанныеСобытия.ИмяБазыСнятияЛогов, ДанныеСобытия.НомерСессии); 
	
	Возврат Ссылка;
		
КонецФункции

Функция ВыполнитьОдиночнуюЗамену(Знач Результат, ПозНач, ПодстрокаПоиска, ПодстрокаЗамены) Экспорт 
	
	Результат = СтрШаблон("%1%2%3", Лев(Результат, ПозНач - 1), ПодстрокаЗамены, Прав(Результат, СтрДлина(Результат) - ПозНач - СтрДлина(ПодстрокаПоиска) + 1));
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции 

Функция ШаблонОтдельностоящих0x01() Экспорт 
	Результат = "((select(\s+top\s+\d?)?(\s+distinct)?\s+|\v|,)\s*)(0x01|\(0x01\))(\s*(union|from|,|\z))";
	Возврат Результат;
КонецФункции

Функция Шаблон0x01вCase() Экспорт 
	Результат = "\b((then|else)\s*)0x01\b";
	Возврат Результат;
КонецФункции

Функция ШаблонTOP() Экспорт 
	Результат = "\b(select(\s+distinct)?)\s+top\s+(\d+)\b";
	Возврат Результат;
КонецФункции

#КонецОбласти