
Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат
	КонецЕсли; 
	
	РеквизитыОшибки = НастройкаТестовСерверПовтИсп.РеквизитыОшибки();
	Реквизиты = Новый Структура(РеквизитыОшибки.РеквизитыСтрокой);
	ЗаполнитьЗначенияСвойств(Реквизиты, ЭтотОбъект);
	
	Наименование = "";
	Для каждого КиЗ Из Реквизиты Цикл
		Если КиЗ.Значение Тогда
			Наименование = СтрШаблон("%1%2%3", Наименование, ?(ПустаяСтрока(Наименование), "", ", "),	РеквизитыОшибки.Реквизиты[КиЗ.Ключ]);
		КонецЕсли;	
	КонецЦикла;                                                                                                             
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	РеквизитыОшибки = НастройкаТестовСерверПовтИсп.РеквизитыОшибки();
	Реквизиты = Новый Структура(РеквизитыОшибки.РеквизитыСтрокой);
	ЗаполнитьЗначенияСвойств(Реквизиты, ЭтотОбъект);
	Если ОбщегоНазначения.КоллекцииИдентичны(Реквизиты, РеквизитыОшибки.СтруктураЛожь) Тогда
		ОбщегоНазначения.СообщитьПользователю("Не установлен ни один флаг ошибки",,,,Отказ);
	КонецЕсли;
	
КонецПроцедуры
