
// Возвращает значение константы
//
// Параметры:
// 		ИмяКонстанты - Строка - Имя константы
// 		ВызыватьИсключениеЕслиНеЗаполнено - Булево - Вызывать исключение если константа не заполнена
//
// Возвращаемое значение:
// 		Произвольное - Значение константы.
//
Функция ЗначениеКонстанты(ИмяКонстанты, ВызыватьИсключениеЕслиНеЗаполнено = Истина) Экспорт 
	лЗначение = Константы[ИмяКонстанты].Получить();
	Если ВызыватьИсключениеЕслиНеЗаполнено И Не ЗначениеЗаполнено(лЗначение) Тогда
		ВызватьИсключение "Не заполнено значение константы " + ИмяКонстанты;	
	КонецЕсли;
	Возврат лЗначение;
КонецФункции
