#Область ПрограммныйИнтерфейс

Функция ЭтапОбработки(НастройкаТеста, ЭтапОбработки) Экспорт 
	
	Результат = НастройкаТестовСервер.ЭтапОбработки(НастройкаТеста, ЭтапОбработки);
	
	Возврат Результат;
	
КонецФункции

Функция СформироватьТекстЗапроса(НастройкаТеста,ДатаСобытия, НомерСессии,НомерСобытия,Режим = 2) Экспорт 
	
	Результат = НастройкаТестовСервер.СформироватьТекстЗапроса(НастройкаТеста,ДатаСобытия, НомерСессии,НомерСобытия,Режим);
	Возврат Результат;
	
КонецФункции

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции 

#КонецОбласти