
Процедура ОбработкаПроверкиЗаполнения(Объект, Отказ, ПроверяемыеРеквизиты) Экспорт 
	
	// Исключаем из проверки реквизиты, заполнение которых стало необязательным:
	МассивНепроверяемыхРеквизитов = Новый Массив();
	Если Объект.РежимЗагрузкиСобытий = 0 Тогда
		МассивНепроверяемыхРеквизитов.Добавить("СтрокаПодключенияКБазеСобытий");
		МассивНепроверяемыхРеквизитов.Добавить("ПользовательБазыСобытий");
		МассивНепроверяемыхРеквизитов.Добавить("ПарольБазыСобытий");
	Иначе
		МассивНепроверяемыхРеквизитов.Добавить("ПапкаССобытиямиMSSQL");
	КонецЕсли;
	
	Если Объект.КоэффициентОжиданияВыполненияЗапросовНаPostgres = 0 Тогда
		МассивНепроверяемыхРеквизитов.Добавить("МинимальнаяДлительностьВыполненияЗапроса");
	КонецЕсли;
	
	// Удаляем из проверяемых реквизитов все, по которым автоматическая проверка не нужна:
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов); 
	
КонецПроцедуры

