
Функция РеквизитыОшибки() Экспорт 
	
	РеквизитыСтрокой = "";
	МассивРеквизитов = Новый Массив();
	Реквизиты = Новый Структура;
	СтруктураЛожь = Новый Структура;
	Для каждого Реквизит Из Метаданные.Справочники.ОшибкиПреобразования.Реквизиты Цикл
		Имя = Реквизит.Имя;
		Представление = Реквизит.Представление();
		Реквизиты.Вставить(Имя, Представление);
		СтруктураЛожь.Вставить(Имя, Ложь);
		МассивРеквизитов.Добавить(Имя);
	КонецЦикла;
	
	РеквизитыСтрокой = СтрСоединить(МассивРеквизитов, ",");
	Результат = Новый Структура("РеквизитыСтрокой, МассивРеквизитов, Реквизиты, СтруктураЛожь", РеквизитыСтрокой, МассивРеквизитов, Реквизиты, СтруктураЛожь);
	
	Возврат Результат;
	
КонецФункции
